app/controllers/histories_controller.rb

  def index
    @histories = History.where(user_id: helpers.current_user)
---
SELECT "histories".* FROM "histories" WHERE "histories"."user_id" IS NULL

  def create

    @history = History.new(history_params)
    @history.user = current_user #guarda el usuario en la historia
    respond_to do |format|
      if @history.save
---
INSERT INTO "histories" ("title", "picture", "content", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @history.update(history_params)
---
UPDATE "histories" SET "title" = ?, "picture" = ?, "updated_at" = ? WHERE "histories"."id" = ?  [["title", "Molotov3"], ["picture", "38be69b0-03c1-450d-99a1-a2efaa56b5d0_374001_CUSTOM.jpg"], ["updated_at", "2017-08-26 03:14:54.325105"], ["id", 1]]

  def destroy
    @history.destroy
---
DELETE FROM "histories" WHERE "histories"."id" = ?  [["id", 1]]

    def set_history
      @history = History.find(params[:id])
---
SELECT  "histories".* FROM "histories" WHERE "histories"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]