app/controllers/lista_usuario_controller.rb

SELECT "histories".* FROM "histories"
---
  def index
  	@user = User.all
    @histories = History.all